# Rebar Container Item Rebar Shape Id Property

Source: https://www.revitapidocs.com/2026/4e755081-80ba-11c1-f428-ed1f0a1f580b.htm

---

| Rebar Container Item Rebar Shape Id Property |
| --- |

The RebarShape element that defines the shape of the rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId RebarShapeId { get; set; }
```

```
Public Property RebarShapeId As ElementId
	Get
	Set
```

```
public:
property ElementId^ RebarShapeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member RebarShapeId : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: shapeId is not the id of a RebarShape in the document.  \-or\-  When setting this property: A RebarContainerItem cannot be created from a Rebar Shape that has End Treatments or Cranks or terminations' rotation angles are different than 0\. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks Changing the value of this property causes the Rebar instance to choose values for its
 shape parameters to preserve its previous shape as closely as possible See Also

#### Reference

RebarContainerItem Class Autodesk.Revit.DB.Structure Namespace